app/Models/modelEmpleados.php

    public function seleccionarEmpleados()
    {
        $consulta = $this->db->table('tbl_empleados e');
        $consulta->select('e.emp_id,e.emp_nombre,e.emp_apellido, e.emp_direccion, e.emp_identificacion,e.emp_salario, r.rol_id, r.rol_nombre');
        $consulta->join('tbl_roles r', 'r.rol_id=e.tbl_roles_rol_id');
        $consulta->where('e.emp_estado', 1);
        $query = $consulta->get();
---
SELECT `e`.`emp_id`, `e`.`emp_nombre`, `e`.`emp_apellido`, `e`.`emp_direccion`, `e`.`emp_identificacion`, `e`.`emp_salario`, `r`.`rol_id`, `r`.`rol_nombre`
FROM `tbl_empleados` `e`
JOIN `tbl_roles` `r` ON `r`.`rol_id`=`e`.`tbl_roles_rol_id`
WHERE `e`.`emp_estado` = 1