app/Models/modelRol.php

    public function selectRol()
    {
        $consulta = $this->db->table('tbl_roles r');
        $consulta->select('r.rol_id,r.rol_nombre');
        $consulta->where('r.rol_estado', 1);
        $query = $consulta->get();
---
SELECT `r`.`rol_id`, `r`.`rol_nombre`
FROM `tbl_roles` `r`
WHERE `r`.`rol_estado` = 1