app/Models/modelTrabajos.php

    public function seleccionarTrabajos()
    {
        $consulta = $this->db->table('tbl_trabajos t');
        $consulta->select('t.trb_id,t.trb_detalle,t.trb_fecha, t.trb_direccion, t.trb_telefono,t.trb_total, t.trb_propietario');
        $consulta->where('t.trb_estado', 1);
        $query = $consulta->get();
---
SELECT `t`.`trb_id`, `t`.`trb_detalle`, `t`.`trb_fecha`, `t`.`trb_direccion`, `t`.`trb_telefono`, `t`.`trb_total`, `t`.`trb_propietario`
FROM `tbl_trabajos` `t`
WHERE `t`.`trb_estado` = 1

    public function eliminarTrabajos($id)
    {
        $consulta = $this->db->table('tbl_trabajos t');
        $consulta->where('t.trb_id', $id);
        $resp = [
            'trb_estado' => 0
        ];
        $consulta->update($resp);
---
UPDATE `tbl_trabajos` `t` SET `trb_estado` = 0
WHERE `t`.`trb_id` = '4'

    public function ultimoTrabajo(){
        $consulta = $this->db->table('tbl_trabajos t');
        $consulta->where('t.trb_estado', 1);
        $consulta->limit(1);
        $consulta->orderBy('t.trb_id', 'DESC');
        $query = $consulta->get();
---
SELECT *
FROM `tbl_trabajos` `t`
WHERE `t`.`trb_estado` = 1
ORDER BY `t`.`trb_id` DESC
 LIMIT 1