app/Models/modelPrincipal.php

    public function selectEmpleados()
    {
        $consulta = $this->db->table('tbl_empleados e');
        $consulta->select('e.emp_id,e.emp_nombre,e.emp_apellido, e.emp_direccion, e.emp_identificacion,e.emp_salario');
        $consulta->where('e.emp_estado', 1);
        $query = $consulta->get();
---
SELECT `e`.`emp_id`, `e`.`emp_nombre`, `e`.`emp_apellido`, `e`.`emp_direccion`, `e`.`emp_identificacion`, `e`.`emp_salario`
FROM `tbl_empleados` `e`
WHERE `e`.`emp_estado` = 1

    public function deleteEmpleados($id)
    {
        $consulta = $this->db->table('tbl_empleados e');
        $consulta->where('e.emp_id', $id);
        $resp = [
            'emp_estado' => 0
        ];
        $consulta->update($resp);
---
UPDATE `tbl_empleados` `e` SET `emp_estado` = 0
WHERE `e`.`emp_id` = '2'

    public function editEmpleados($id,$nombre, $apellido, $direccion, $identificacion, $salario)
    {
        $consulta = $this->db->table('tbl_empleados e');
        $consulta->where('e.emp_id', $id);
        $resp = [
            'emp_nombre' => $nombre,
            'emp_apellido' => $apellido,
            'emp_direccion' => $direccion,
            'emp_identificacion' => $identificacion,
            'emp_salario' => $salario,
            'emp_estado' => 1
        ];
        $consulta->update($resp);
---
UPDATE `tbl_empleados` `e` SET `emp_nombre` = 'Abi', `emp_apellido` = 'Sanchezzzz', `emp_direccion` = 'Ibarra', `emp_identificacion` = '2101131262', `emp_salario` = '30', `emp_estado` = 1
WHERE `e`.`emp_id` = '1'