app/Models/modelEmpTrb.php

SELECT `et`.`etr_id`, `et`.`tbl_empleados_emp_id`, `et`.`tbl_trabajos_trb_id`, `e`.`emp_id`, `e`.`emp_nombre`, `e`.`emp_apellido`
FROM `tbl_emp_trb` `et`
JOIN `tbl_empleados` `e` ON `et`.`tbl_empleados_emp_id`=`e`.`emp_id`
JOIN `tbl_trabajos` `t` ON `et`.`tbl_trabajos_trb_id`=`t`.`trb_id`
WHERE `et`.`etr_estado` = 1
---
    public function selectEmpTrb()
    {
        $consulta = $this->db->table('tbl_emp_trb et');
        $consulta->select('et.etr_id ,et.tbl_empleados_emp_id,et.tbl_trabajos_trb_id, e.emp_id, e.emp_nombre, e.emp_apellido,  ');
        $consulta->join('tbl_empleados e', 'et.tbl_empleados_emp_id=e.emp_id');
        $consulta->join('tbl_trabajos t', 'et.tbl_trabajos_trb_id=t.trb_id');
        $consulta->where('et.etr_estado', 1);
        $query = $consulta->get();