app/Models/modelAcceso.php

    public function login($user)
    {
        $consulta = $this->db->table('tbl_usuarios u');
        $consulta->select('u.us_id,u.us_estado ,u.us_usuario, u.us_password');
        $consulta->where('u.us_usuario', $user['USUARIO']);
        $consulta->where('u.us_password', $user['PASSWORD']);
        $query = $consulta->get();
---
SELECT `u`.`us_id`, `u`.`us_estado`, `u`.`us_usuario`, `u`.`us_password`
FROM `tbl_usuarios` `u`
WHERE `u`.`us_usuario` = 'admin'
AND `u`.`us_password` = 'admin'